Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །ནམ་མཁའ་ལས་ནི་རླུང་ཡང་རབ་གཏང་ཞིང་།
en: And the wind blowing through the sky.

source: །ཡབ་ཅིག་དོ་མོད་དགེ་སྦྱོང་བཟུང་ནས་ནི།
en: Father, I will catch that mendicant this very day

source: །རླུང་གིས་ཕུབ་མ་བཞིན་དུ་གཏོར་བར་བགྱི།
en: And blow him away like a handful of husk.”

source: །གཡས་རོལ་ནས་བདུད་ཀྱི་བུ་བློ་གྲོས་མི་གཡོ་བ་ཞེས་བྱ་བ་དེས་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཇི་ལྟར་ཁྱོད་ཀྱི་ཤུགས་མགྱོགས་དྲག་པ་ལྟར།
en: From the right side, Māra’s son named Acalamati said:

source: །གལ་ཏེ་ལྷ་དང་མི་རྣམས་དེ་འདྲར་གྱུར།
en: “Even if all gods and humans became As swift and strong as you are

source: །དེ་དག་ཐམས་ཅད་གཅིག་ཏུ་འདུས་པས་ཀྱང་།
en: And gathered in a single place,

source: །ཟླ་མེད་གང་ཟག་དེ་ལ་གནོད་མི་ནུས།
en: They would be unable to harm this peerless being.”

source: །གཡོན་རོལ་ནས་ཚངས་པའི་བློ་གྲོས་ཀྱིས་སྨྲས་པ།
en: From the left side, Brahmamati said:

source: དེ་འདྲའི་དྲག་པོ་ཕལ་ཆེར་གྱུར་ཀྱང་ནི།
en: “If there was such a fierce crowd of our men,

source: །ཁྱོད་ཀྱི་ང་རྒྱལ་ཅུང་ཟད་འཇོམས་མི་ནུས།
en: He could do nothing to wound your pride.

source: །བགྱི་བ་ཐམས་ཅད་མང་པོས་འགྲུབ་ལགས་ན།
en: Since all tasks are accomplished by teams,

source: །གཅིག་པུས་ཁྱོད་ལ་ཅི་བགྱི་སྨོས་ཅི་འཚལ།
en: How could he harm you just on his own?”

source: །གཡས་རོལ་ནས་སེང་གེའི་བློ་གྲོས་ཀྱིས་སྨྲས་པ།
en: From the right side, Siṃhamati said:

source: ས་ལ་སེང་གེ་ཁྱུས་འཁོད་སྔོན་མ་བྱུང་།
en: “Lions have never been seen sitting on the ground in a row;

source: །ལྟ་བའི་གདུག་པ་དག་ཀྱང་ཁྱུས་མི་འཁོད།
en: Those with a poisonous gaze do not team up.

source: །གཟི་ལྡན་བདེན་པ་ཕ་རོལ་གནོན་པ་པོ།
en: Those splendorous beings that have courage because of being true,

source: །སྐྱེས་བུ་ཁྱུ་མཆོག་རྣམས་ཀྱང་ཁྱུས་མི་འཁོད།
en: Those supreme leaders of beings also do not congregate together.”

source: །གཡོན་རོལ་ནས་ཐམས་ཅད་དུ་གདོལ་པ་ཞེས་བྱ་བས་སྨྲས་པ།
en: From the left side, Sarvacaṇḍāla said:

source: ཇི་ལྟར་ཁྱོད་ཀྱི་སྲས་པོ་བརྩོན་འགྲུས་དང་། །ཤུགས་དང་སྟོབས་དང་ལྡན་པ་སྒྲ་སྒྲོགས་པ།
en: “Father, you have not heard such heated voices before As those your sons are calling out with now.

source: །ཚིག་འབར་དེ་འདྲ་ཡབ་ཀྱིས་སྔོན་གསན་ཏམ། །མྱུར་དུ་དགེ་སྦྱོང་དེ་ནི་གཞོམ་དུ་བཞུད།
en: Mustering diligence, speed, and power, Let’s quickly go and destroy that monk!”

source: །གཡས་རོལ་ནས་སེང་གེ་སྒྲ་སྒྲོགས་ཞེས་བྱ་བས་སྨྲས་པ།
en: From the right side, Siṃhanādin said:

source: ནགས་ཚལ་དག་གི་ཁྲོད་ན་ཝ་མང་པོས། །སེང་གེ་མེད་པ་དེ་ན་སྒྲ་ཡང་སྒྲོགས། །སེང་གེས་སྒྲ་བསྒྲགས་འཇིགས་པ་ཐོས་པ་དང་། །སྐྲག་ནས་ཕྱོགས་ཕྱོགས་དག་ཏུ་རབ་ཏུ་འབྲོས།
en: “In the midst of the jungle, when the lion is not there, Many jackals bark. Yet when they hear the lion’s frightening roar, They flee in panic in all directions.

source: །དེ་ལྟར་བདུད་བུ་མི་མཁས་འདི་དག་ཀྱང་།
en: “In the same way, these ignorant sons of Māra,

source: །མི་མཆོག་གསུང་ནི་མ་ཐོས་དེ་བར་དུ།
en: As long as they have not heard the voice of the perfect man,

source: །དེ་དག་སྤྱི་བརྟོལ་བྱེད་ཅིང་བྱུང་རྒྱལ་སྨྲ།
en: Raise their voices, opinionated and impudent,

source: །མི་ཡི་སེང་གེས་གསུང་བསྒྲགས་འབྲོས་པར་འགྱུར།
en: While the lion of men remains silent.”

source: །གཡོན་རོལ་ནས་ཉེས་པར་བསམ་པ་སེམས་པས་སྨྲས་པ།
en: From the left side, Duścintita­cintin said:

source: བདག་གིས་གང་བསམས་མྱུར་དུ་འདིར་འགྲུབ་ན།
en: “Whatever I wish for is quickly accomplished,

source: །དེ་ནི་ཅི་སླད་དཔུང་ཚོགས་འདི་མི་ལྟ། །གང་ཕྱིར་ལངས་ཏེ་མྱུར་དུ་མི་འབྲོས་པས། །དེ་ནི་གླེན་པ་ཆོ་ག་མ་འཚལ་བ།
en: So why does he not look at us with circumspection? He must be either deluded or ignorant Since he does not rise up quickly and flee.”

source: །གཡས་རོལ་ནས་དོན་ལེགས་པར་བསམ་པ་སེམས་པ་ཞེས་བྱ་བས་སྨྲས་པ།
en: From the right side, Sucintitārtha said:

source: དེ་ནི་མི་གླེན་ཕ་རོལ་གནོན་པ་སྟེ།
en: “He is neither a fool nor a weakling;

source: །ཁྱེད་ཅག་གླེན་ཞིང་ཤིན་ཏུ་མ་བསྡམས་པ།
en: You yourselves are the fools, so extremely careless.

source: །ཁྱེད་ཀྱིས་དེ་ཡི་མཐུ་རྩལ་ཡོང་མི་ཤེས།
en: You have no idea about his valor;

source: །དེ་ཡི་ཤེས་རབ་སྟོབས་ཀྱིས་ཐམས་ཅད་ཕམ།
en: The power of his insight will conquer you all.

source: །བདུད་ཀྱི་བུ་ནི་གང་གཱའི་བྱེ་མ་སྙེད། །ཁྱེད་ཅག་རྣམས་ཀྱིས་དེ་འདྲའི་མཐུ་རྩལ་ཅན།
en: “Even with the strength of demonic sons Equal in number to the grains of sand in the river Ganges,

source: །དེ་ཡི་བ་སྤུ་གཅིག་ཀྱང་གཡོས་མི་ནུས།
en: You would not be able to bend a single hair on his head,

source: །གསད་པར་བསམས་པ་མི་འགྲུབ་སྨོས་ཅི་དགོས།
en: So how much less could you kill him?

source: །ཁྱོད་ནི་དེ་ལ་ཡིད་ཀྱིས་གནོད་མ་སེམས།
en: “Do not corrupt your minds;

source: །གུས་དང་བཅས་པར་དད་པའི་སེམས་སུ་གྱིས།
en: Instead you should respect him with devotion.

source: །འདི་ནི་སྲིད་གསུམ་རྒྱལ་པོར་གྱུར་པས་ན།
en: He is about to become king of the three realms;

source: །འཐབ་མོ་མ་བྱེད་པར་ནི་སླར་ལོག་ཤིག །དེ་བཞིན་དུ་སྦྱར་ཏེ་དེ་ལྟར་བདུད་ཀྱི་བུ་དཀར་པོའི་ཕྱོགས་པ་དང་ནག་པོའི་ཕྱོགས་པ་སྟོང་དུ་ཚང་བ་དེ་དག་ཐམས་ཅད་ཀྱིས་སོ་སོ་ནས་བདུད་སྡིག་ཅན་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་སོ།
en: Turn back and do not make war.” In this way a thousand of Māra’s sons, both good and bad, each further addressed Māra, the evil one, in verses.

source: །དེ་ནས་བདུད་སྡིག་ཅན་གྱི་སྡེ་དཔོན་སྡེ་བཟང་པོ་ཞེས་བྱ་བ་དེས་བདུད་སྡིག་ཅན་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: At the end, Bhadrasena, the general of Māra, spoke these verses to him:

source: །གང་དག་ཁྱོད་ཀྱི་རྗེས་འབྲང་བརྒྱ་བྱིན་དང་། །སྐྱོང་དང་མིའམ་ཅི་ཡི་ཚོགས་རྣམས་དང་། །ལྷ་མིན་དབང་དང་མཁའ་ལྡིང་དབང་པོ་རྣམས།
en: “All those who normally follow you, such as Śakra, The guardians, the hordes of half kinnaras, The leaders of the demigods, and the leaders of the garuḍas,

source: །ཐལ་མོ་སྦྱར་ཏེ་དེ་ལ་ཕྱག་འཚལ་ན།
en: Now they all join their palms and bow to the Bodhisattva.

source: །ཁྱོད་ཀྱི་རྗེས་སུ་འབྲང་བ་མ་ལགས་པ།
en: “So what need is there to mention those who do not follow you,

source: །ཚངས་པ་འོད་གསལ་ལྷ་ཡི་བུ་རྣམས་དང་། །གནས་གཙང་རིས་ཀྱི་ལྷ་རྣམས་དེ་དག་ཀུན།
en: Brahmā and the luminous gods, And the gods of the pure realms—

source: །དེ་ལ་ཕྱག་འཚལ་བ་ནི་སྨོས་ཅི་འཚལ།
en: They, too, all bow to him.

source: །ཁྱོད་ཀྱི་སྲས་པོ་ཤེས་རབ་ཅན།
en: “Even those of your sons who are wise,

source: །སྟོབས་དང་ལྡན་ཞིང་ཡིད་གཞུངས་པ། །དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་ལ།
en: Who are powerful and smart, Venerate the Bodhisattva

source: །སྙིང་དང་འཐུན་གྱུར་ཕྱག་འཚལ་ལོ།
en: In accord with his essence.

source: །དཔག་ཚད་བརྒྱད་ཅུར་ཁྱབ་པ་ཡི། །གནོད་སྦྱིན་ལ་སོགས་བདུད་དཔུང་འདི།
en: “This army of yakṣas and other beings, Which extends for eighty leagues,

source: །ཕལ་ཆེར་རབ་ཏུ་དང་ཡིད་ཀྱིས།
en: Is seen in full by the All-Seeing One,

source: །ཀུན་ཀྱང་ཉེས་པ་མེད་ལ་ལྟ།
en: With a clear mind and without hatred.

source: །འཇིགས་སུ་རུང་ཞིང་དྲག་བསྒྱུར་བ།
en: “Since he is neither taken aback nor stirred

source: །དཔུང་ཚོགས་མི་བཟད་འདི་གཟིགས་ནས།
en: When seeing this wild and fierce army,

source: །ངོ་མཚར་མ་གྱུར་ཞུམ་མི་མངའ།
en: So hideous and frightening,

source: །ངེས་པར་དོ་མོད་འདི་རྒྱལ་འགྱུར།
en: His victory is certain now.

source: །གང་ན་དཔུང་འདི་གནས་པ་དེར།
en: “Wherever this army is found,

source: །ཝ་དང་འུག་པ་སྒྲ་འབྱིན་ལ།
en: The cries of the jackal and the owl are heard.

source: །བྱ་རོག་བོང་བུ་སྒྲ་འབྱིན་པས།
en: When the calls of the crow and the donkey ring out,

source: །མྱུར་དུ་སླར་ནི་ལྡོག་པའི་རིགས།
en: It is wise to quickly retreat.

source: །བྱང་ཆུབ་སྙིང་པོར་གཟིགས་སུ་གསོལ།
en: “Please look toward the seat of awakening!

source: །པ་ཏ་ཀུན་ཏ་ངང་པ་དང་། །ཁུ་བྱུག་རྨ་བྱ་མངོན་སྐོར་བས།
en: Clever curlews, swans, cuckoos, and peacocks Are circumambulating the Bodhisattva.

source: །རྡུལ་དང་སྣག་ཙའི་ཆར་འབབ་ལ།
en: Dust and soot rain from the sky.

source: །ས་དཀྱིལ་མེ་ཏོག་ཆར་འབབ་པས།
en: Yet at the seat of awakening, a rain of flowers falls,

source: །བདག་གི་ཚིག་བཞིན་ལྡོག་པའི་རིགས།
en: So heed my words and turn back!

source: །གང་ན་དཔུང་འདི་གནས་པ་དེ།
en: “Wherever this army is found,

source: །ཤང་ཤོང་གྱུར་ཅིང་ཚེར་མས་གང་།
en: The ground is uneven and filled with thorns and prickles.

source: །ས་དཀྱིལ་དྲི་མེད་གསེར་གྱུར་པས།
en: Yet at the seat of awakening, the ground is stainless like gold,

source: །ཤེས་རབ་ཅན་དག་ལྡོག་པའི་རིགས།
en: So it is better for the wise to retreat.

source: །གལ་ཏེ་མི་འདོད་སྔར་རྨིས་པའི། །རྨི་ལམ་དེ་དག་མངོན་སུམ་འགྱུར།
en: “The past nightmares Will now come true.

source: །དྲང་སྲོང་རྣམས་ཀྱི་ཡུལ་བརླག་པ། །དེ་བཞིན་དཔུང་འདི་ཐལ་བར་རློག །རྒྱལ་པོ་འགྲོ་བ་དྲང་སྲོང་མཆོག །
en: If you do not retreat, He will reduce this army to dust, Just as countries are destroyed by the sages.

source: ཚངས་པས་བྱིན་གྱིས་ཁྲོས་བྱས་པས། །དན་ད་ཀ་ཡི་ནགས་ཚལ་ཚིག
en: “When the supreme, masterful sage Became angry with King Brahmadatta,

source: །ལོ་མང་ཞིག་ཏུ་རྩྭ་མ་སྐྱེས། །དྲང་སྲོང་བརྟུལ་ཞུགས་སྤྱོད་པ་པོ།
en: He burned the Daṇḍaka Forest So that for many years no grass would grow.

source: །དཀའ་ཐུབ་ལྡན་པའི་འཇིག་རྟེན་ན།
en: “Whatever sages there are who practice disciplined conduct

source: །ཇི་སྙེད་འཁོད་པ་ཀུན་གྱི་མཆོག །འབྱུང་པོ་ཀུན་ལ་མི་འཚེ་འདི། །གང་གི་ལུས་ལ་མཚན་རབ་འབར།
en: And practice austerities, He is supreme among them, For he does not harm any living being.

source: །ཁྱིམ་ནས་ཀྱང་ནི་བྱུང་བ་དེར། །ཉོན་མོངས་ཕམ་བྱས་འཚང་རྒྱ་ཞེས། །ཁྱོད་ཀྱིས་སྔོན་ཆད་མ་གསན་ནམ།
en: “Have you not heard before That the one whose body blazes with all the marks And who walks away from his home Will conquer disturbing emotions and attain awakening?

source: །རྒྱལ་སྲས་རྣམས་ཀྱིས་མཆོད་དོན་དུ།
en: “The sons of the victors manifest such great powers

source: །འབྱོར་པ་འདི་འདྲ་འདི་དག་སྤྲུལ།
en: As an act of worship,

source: །དེ་བས་ངེས་པར་སེམས་ཅན་མཆོག །སྦྱིན་བསྲེག་དམ་པ་ལེན་པར་འགྱུར།
en: For isn’t the Supreme Being A worthy recipient of the best of offering rites?

source: །འདི་ཡི་མཛོད་སྤུ་དྲི་མེད་པ།
en: “Since the immaculate hair between his eyebrows

source: །བྱེ་བ་ཁྲག་ཁྲིག་ཞིང་དུ་མཛེས།
en: Beautifies a trillion realms

source: །དེ་ཡིས་བདག་ཅག་མོག་མོག་བགྱིས།
en: And outshines all of us,

source: །བདུད་དཔུང་ངེས་བཅོམ་གདོན་མི་འཚལ།
en: He will surely conquer Māra’s army.

source: །སྲིད་པའི་རྩེ་གནས་ལྷ་རྣམས་ཀྱིས།
en: “Since the gods at the peak of existence

source: །དེ་ཡི་སྤྱི་གཙུག་བལྟར་མི་ནུས།
en: Are unable to see the crown of his head,

source: །ངེས་པར་གཞན་གྱིས་མ་བསྟན་པར།
en: So, surely, without being taught by others,

source: །ཐམས་ཅད་མཁྱེན་ཉིད་ཐོབ་པར་འགྱུར། །ཇི་ལྟར་ལྷུན་པོ་ཁོར་ཡུག་དང་། །ཉི་ཟླ་བརྒྱ་བྱིན་ཚངས་པ་དང་། །ཤིང་ལྗོན་རྣམས་དང་རི་མཆོག་ཀུན།
en: He will attain omniscience. “Since Mount Meru and the surrounding ranges, The sun, the moon, Śakra, Brahmā, All the trees, and the best of mountains

source: །ས་དཀྱིལ་ཕྱག་འཚལ་བགྱིད་ལས་ན།
en: All prostrate to the seat of awakening,

source: །བསོད་ནམས་སྟོབས་ཅན་ཤེས་རབ་སྟོབས། །ཡེ་ཤེས་སྟོབས་ཅན་བཟོད་པའི་སྟོབས། །བརྩོན་འགྲུས་སྟོབས་དང་ལྡན་པ་དེ།
en: “It is certain that the one with the power of merit, The powers of knowledge and wisdom, And the powers of forbearance and diligence,

source: །བདུད་ཕྱོགས་སྟོབས་མེད་མཛད་པར་ངེས།
en: Will render Māra’s factions powerless.

source: །གླང་པོས་སོ་མ་བཏང་སྣོད་དང་། །སེང་གེས་ཇི་ལྟར་ཝ་བཅོམ་དང་། །ཉི་མས་སྲིན་བུ་མེ་ཁྱེར་ལྟར།
en: “Like an elephant stepping on a fresh clay pot, Or a lion fighting a fox, Or the sun effacing a firefly,

source: །བདེ་བར་གཤེགས་པས་དཔུང་བཅོམ་འགྱུར།
en: The Well-Gone One will obliterate our army.”

source: །ཚིག་དེ་སྐད་ཐོས་པ་དང་བདུད་ཀྱི་བུ་གཞན་ཞིག་ཤིན་ཏུ་ཁྲོས་ནས་མིག་དམར་པོར་གྱུར་ཏེ་སྨྲས་པ།
en: Upon hearing these words, another son of Māra became enraged and, with bloodshot eyes, he said:

source: ཁྱོད་ནི་གཅིག་པུ་དེ་ཡི་བསྔགས་པ་དག །ཤིན་ཏུ་དཔག་ཏུ་མེད་པར་རྗོད་བྱེད་ན།
en: “Your praise for this lone person Is without any bounds.

source: །གཅིག་པུ་དེས་ནི་ཅི་ཞིག་བྱ་བར་ནུས།
en: What could that single man be capable of?

source: །འཇིགས་སུ་རུང་བའི་དཔུང་ཆེན་མ་མཐོང་ངམ།
en: Can’t you see this great and terrifying army?”

source: །དེ་ནས་གཡས་རོལ་ནས་བདུད་ཀྱི་བུ་བདུད་རབ་ཏུ་འཇོམས་པ་ཞེས་བྱ་བས་སྨྲས་པ།
en: Then from the right side, the son of Māra called Māra­pramardaka said:

source: འཇིག་རྟེན་ཉི་ཟླ་སེང་གེ་དང་། །འཁོར་ལོས་སྒྱུར་ལ་གྲོགས་བྱེད་མེད།
en: “It is not necessary to help the sun in this world, Nor the lion or the universal monarch.

source: །བྱང་ཆུབ་བཞུགས་ནས་ངེས་པ་ཡི།
en: The Bodhisattva sitting with resolve for awakening

source: །བྱང་ཆུབ་སེམས་དཔའ་གྲོགས་མི་དགོས།
en: Surely does not need any helpers.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་བདུད་མཐུ་ཆུང་བར་བྱ་བའི་ཕྱིར་གང་མཐོང་བས་བདག་གི་དཔུང་བྱང་ཆུབ་སེམས་དཔའི་ཁའི་ནང་དུ་ཞུགས་སོ་སྙམ་དུ་སེམས་ཤིང་བདུད་བྲོས་པར་གྱུར་པ་དང་། བྲོས་ནས་ཀྱང་ཅི་ཡང་མ་ཡིན་ནོ་སྙམ་ནས་ཡང་སླར་ལོག་སྟེ།
en: At that point, in order to weaken the strength of the demons, the Bodhisattva turned his face, which resembled a blooming lotus with one hundred petals, toward them. Upon seeing the Bodhisattva’s face, Māra took flight. But while fleeing, he had the thought that his army could withstand the sight of the Bodhisattva’s face, and he once again turned back.

source: འཁོར་དང་བཅས་པས་མཚོན་ཆ་རྣམ་པ་སྣ་ཚོགས་བྱང་ཆུབ་སེམས་དཔའི་སྟེང་དུ་འཕེན་ཅིང་།
en: Assisted by his followers, he now began to hurl various weapons upon the Bodhisattva.

source: རི་རབ་ཙམ་གྱི་རི་དེ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་སྟེང་དུ་འཕངས་པ་དང་། མེ་ཏོག་གི་བླ་རེ་དང་། གཞལ་མེད་ཁང་དུ་གྱུར་ཏེ་གནས་པ་དང་། གང་དག་མིག་གདུག་པ་དང་། མྱུར་དུ་གདུག་པ་དང་། དབུགས་གདུག་པ་རྣམས་མེ་ལྕེ་གཏོང་བའི་མེའི་དཀྱིལ་འཁོར་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ལ་འོད་ཀྱི་དཀྱིལ་འཁོར་ལྟ་བུར་གནས་པར་བྱ་བའི་ཕྱིར་པད་མ་འདབ་མ་བརྒྱ་པ་རྒྱས་པ་ལྟ་བུའི་བཞིན་བསྐྱོད་དོ།
en: However, even when they threw mountains as big as the central mountain at the Bodhisattva, the mountains all turned into flower canopies and celestial palaces. Those with poisonous gazes, those with poisonous snakes, and those with poisonous breath shot flames of fire at the Bodhisattva. Yet this circle of fire just turned into what seemed to be the Bodhisattva’s halo of light.

source: །དེ་ནས་ཡང་བྱང་ཆུབ་སེམས་དཔས་ལག་པ་གཡས་པས་མགོ་ལ་བྱུགས་པ་དང་། བདུད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་ལག་ན་རལ་གྲི་ཐོགས་པར་མཐོང་ནས་ལྷོ་ཕྱོགས་སུ་བྲོས་པ་དང་ཅི་ཡང་མ་ཡིན་ནོ་སྙམ་ནས་ཡང་སླར་ལོག་གོ།
en: The Bodhisattva now touched his right hand to his head. Māra perceived that the Bodhisattva was brandishing a sword in his hand, and so he fled toward the south. However, thinking that it could not be true after all, he again returned.

source: །སླར་ལོག་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་སྟེང་དུ་མཚོན་ཆ་རྣམ་པ་སྣ་ཚོགས་རལ་གྲི་དང་། མདའ་གཞུ་དང་། མདུང་ཐུང་དང་། མདའ་བོ་ཆེ་དང་། དགྲ་སྟ་དང་། བོང་བ་དང་། གཏུན་ཤིང་དང་། རྡོ་རྗེ་རྩེ་གཅིག་པ་དང་། དབྱུག་ཏོ་དང་། འཁོར་ལོ་དང་། ཐོ་བ་དང་། ཤིང་དྲུངས་ཕྱུང་དང་། ཕ་བོང་དང་། ཞགས་པ་དང་། ལྕགས་ཀྱི་ཐུ་ལུམ་ཤིན་ཏུ་འཇིགས་པ་དུ་མ་འཕེན་ཏེ།
en: When he came back, the demons began to hurl all sorts of terrifying weapons at the Bodhisattva. They threw swords, arrows, darts, lances, axes, clubs, javelins, bludgeons, discuses, vajras, hammers, uprooted trees, rocks, lassos, and iron balls.

source: དེ་དག་ཀྱང་འཕངས་མ་ཐག་ཏུ་མེ་ཏོག་གི་ཕྲེང་བ་དང་། མེ་ཏོག་གི་བླ་རེར་གྱུར་ཏེ་གནས་སོ།
en: However, as soon as the demons released the weapons, the weapons turned into garlands and canopies of flowers, and a cooling rain of flower petals fell on the ground.

source: །མེ་ཏོག་སིལ་མར་ཡང་གྱུར་ནས་ས་ལ་འཐོར་བ་དང་། ཕྲེང་བའི་ཆུན་པོར་ཡང་འཕྱང་བས་བྱང་ཆུབ་ཀྱི་ཤིང་བརྒྱན་པར་གྱུར་ཏོ།
en: The flower garlands hung as adornments on the Bodhi tree.

source: །བྱང་ཆུབ་སེམས་དཔའི་བཀོད་པ་འབྱོར་པ་དེ་དག་མཐོང་ནས་བདུད་སྡིག་ཅན་ཕྲག་དོག་དང་སེར་སྣས་སེམས་ལ་གནོད་དེ།
en: When Māra, the evil one, witnessed the Bodhisattva’s power and the displays that he performed, his mind was disturbed with jealousy and avarice.

source: བྱང་ཆུབ་སེམས་དཔའ་ལ་སྨྲས་པ། ཀྱེ་རྒྱལ་བུ་གཞོན་ནུ་བཞེངས། བཞེངས།
en: He called out to the Bodhisattva, “Listen, young prince, get up!

source: རྒྱལ་སྲིད་ལ་སྤྱོད་ཅིག །ཁྱོད་ཀྱི་བསོད་ནམས་དེ་ཙམ་གྱིས་ཁྱོད་ཀྱིས་ཐར་པ་ག་ལ་འཐོབ།
en: Get up and relish your kingship—your virtue lies precisely in doing that! On what grounds could you ever attain liberation?”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་བརྟན་ལ་ཟབ་ཅིང་རྒྱ་ཆེ་བ་དང་། འཇམ་ཞིང་སྙན་པའི་ཚིག་གིས་བདུད་སྡིག་ཅན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The Bodhisattva answered Māra, the evil one, with words that were firm, profound, vast, gentle, and sweet:

source: །སྡིག་ཅན་ཁྱོད་ཀྱིས་ནི་གཏན་པ་མེད་པའི་མཆོད་སྦྱིན་གཅིག་གིས་འདོད་པའི་དབང་ཕྱུག་ཐོབ་ཏུ་ཟད་དོ།
en: “You, evil one! Through just a single unstinting act of giving, you have become lord of the desire realm.

source: །ངས་ནི་མཆོད་སྦྱིན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མས་གཏན་པ་མེད་པའི་མཆོད་སྦྱིན་བྱས་སོ།
en: I, on the other hand, have performed trillions of unstinting acts of giving.

source: །ལག་པ་དང་། རྐང་པ་དང་། མིག་དང་། མགོ་དག་ཀྱང་བཅད་ཅིང་སློང་བ་རྣམས་ལ་བྱིན་ནོ།
en: I have cut off my hands, legs, eyes, and my head, and given them to beggars.

source: །སེམས་ཅན་རྣམས་ཐར་བར་བྱ་བའི་ཕྱིར་ཁྱིམ་དང་། ནོར་དང་། འབྲུ་དང་། མལ་ཆ་དང་། གོས་དང་། འཆག་ས་དང་། སྐྱེད་མོས་ཚལ་རྣམ་པ་དུ་མ་དག་ཀྱང་སློང་བ་རྣམས་ལ་བྱིན་ནོ།
en: With the intention to liberate sentient beings, I have often given beggars my house, wealth, grains, beds, clothes, and parks.”

source: །དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་ཚིགས་སུ་བཅད་དེ་བྱང་ཆུབ་སེམས་དཔའ་ལ་སླར་སྨྲས་པ།
en: Māra, the evil one, replied with this verse:

source: སྔོན་ཆད་ཁོ་བོས་མཆོད་སྦྱིན་ཁ་ན་མ་ཐོ་མེད།
en: “Previously I made a wholesome act of giving;

source: །གཏན་པ་མེད་པ་བྱས་པ་ཁྱོད་འདིར་དཔང་དུ་ཡོད།
en: It was an unstinting act, and you are my witness.

source: །ཁྱོད་ལ་འདི་ན་དཔང་པོ་གང་ཡང་ཡོད་མིན་པས།
en: But you have no witness to your acts,

source: །སྨྲས་ཀྱང་ཕན་པ་ཅི་ཡོད་ཁྱོད་ནི་ཕམ་པར་གྱུར།
en: So there is no point in speaking of them, and instead you will be conquered.”

source: །བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། སྡིག་ཅན་ས་འདི་ནི་ངའི་དཔང་ཡིན་ནོ།
en: The Bodhisattva replied, “Evil one, the earth here is my witness.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་བདུད་སྡིག་ཅན་དང་བདུད་ཀྱི་འཁོར་ལ་བྱམས་པ་དང་སྙིང་རྗེ་སྔོན་དུ་འགྲོ་བའི་སེམས་ཀྱིས་ཁྱབ་པར་བྱས་ནས།
en: He then embraced Māra, the evil one, and his demonic retinue with thoughts of love and compassion.

source: སེང་གེ་ལྟར་མི་འཇིགས་མི་སྐྲག་ལ་བག་ཚ་བ་མེད་ཅིང་མི་དམན་ལ་མ་ཞུམ་པ་དང་། མ་འཁྲུགས་པ་དང་། མ་རྙོགས་པ་དང་། འཇིགས་པ་དང་། སྤུ་ཟིང་ཞེས་བྱེད་པ་མེད་པར་ལག་མཐིལ་ན་དུང་དང་། རྒྱལ་མཚན་དང་། ཉ་དང་། བུམ་པ་དང་། བཀྲ་ཤིས་པ་དང་། ལྕགས་ཀྱུ་དང་། འཁོར་ལོའི་མཚན་མ་ཡོད་པ།
en: Like a lion, he was without fear, fright, anxiety, timidity, disturbance, and perturbation. He had no goose bumps, which indicate fear. He now let his right hand slide over his entire body and then gracefully tapped on the earth—the hand that had the contours of a conch, a victory banner, a fish, a vase, a swastika, an iron hook, and a wheel.

source: སོར་མོ་བར་དྲ་བས་འབྲེལ་བ།
en: The hand’s fingers were connected by a web.

source: སེན་མོ་ཤིན་ཏུ་མཛེས་ཤིང་ཟངས་ཀྱི་མདོག་ལྟར་འདུག་པས་བརྒྱན་པ།
en: Its nails were exquisite and copper colored.

source: འཇམ་ཞིང་མཉེན་ལ་ཤིན་ཏུ་གཞོན་པ།
en: Soft and supple, it looked perfectly youthful.

source: བསྐལ་པ་དཔག་ཏུ་མེད་པར་དགེ་བའི་རྩ་བའི་ཚོགས་བསགས་པས་གྲུབ་པའི་ལག་པ་གཡས་པས་ལུས་ཐམས་ཅད་ལ་བྱུགས་ནས་ཚུལ་དུ་ཤིས་པར་ས་ལ་བརྡབས་ཏེ་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་ཡང་སྨྲས་སོ།
en: All this was the result of limitless eons of gathering the accumulations of basic goodness. He then spoke this verse:

source: །ས་འདི་འགྲོ་བ་ཀུན་གྱི་གནས་ཡིན་ཏེ།
en: “This earth supports all beings;

source: །རྒྱུ་དང་མི་རྒྱུ་སྙོམས་ཤིང་ཉེ་འཁོན་མེད།
en: She is impartial and unbiased toward all, whether moving or still.

source: །འདི་ནི་བདག་གི་དཔང་སྟེ་བདག་བརྫུན་མེད།
en: She is my witness that I speak no lies;

source: །འདི་ལ་ཁྱོད་ནི་བདག་གི་དཔང་བྱོས་ཤིག །བྱང་ཆུབ་སེམས་དཔས་ས་ཆེན་པོ་འདི་ལ་རེག་མ་ཐག་ཏུ་རྣམ་པ་དྲུག་ཏུ་གཡོས།
en: So may she bear my witness.” As soon as the Bodhisattva touched this great earth, it shook in six different ways.

source: རབ་ཏུ་གཡོས། ཀུན་ཏུ་རབ་ཏུ་གཡོས་སོ། །ཆེམ་ཆེམ། རབ་ཏུ་ཆེམ་ཆེམ། ཀུན་ཏུ་རབ་ཏུ་ཆེམ་ཆེམ་མོ།
en: It quivered, trembled, and quaked, and it boomed, thundered, and roared.

source: །འདི་ལྟ་སྟེ་དཔེར་ན། ཡུལ་མ་ག་དྷཱའི་བརྡབ་ཁར་སྒྲ་འབྱུང་ཞིང་སྒྲ་རྒྱུན་རིང་བ་དེ་བཞིན་དུ་ས་ཆེན་པོ་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ལག་པས་བསྣུན་མ་ཐག་ཏུ་སྒྲ་བྱུང་ཞིང་སྒྲ་རྒྱུན་རིང་དུ་བྱུང་ངོ་།། །།
en: Just as a Magadhan brass cauldron, when struck with a wooden log, chimes and reverberates, so did this great earth sound and reverberate when struck by the Bodhisattva with his hand.

source: དེ་ནས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་སའི་ལྷ་མོ་བརྟན་མ་ཞེས་བྱ་བ་སའི་ལྷ་མོའི་འཁོར་བྱེ་བ་ཕྲག་བརྒྱ་དང་ལྡན་པ་གང་ཡིན་པ་དེས་ས་ཆེན་པོ་ཐམས་ཅད་གཡོས་པར་བྱས་ནས།
en: Then the earth goddess in this great trichiliocosm who is called Sthāvarā, along with her retinue of one billion earth goddesses, began to shake the entire great earth.

source: བྱང་ཆུབ་སེམས་དཔའ་དང་ཧ་ཅང་ཡང་མི་རིང་བ་ཞིག་ཏུ་ས་བརྟོལ་ཏེ། ལུས་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་ཕྱེད་ཕྱུང་ནས་བྱང་ཆུབ་སེམས་དཔའ་ག་ལ་བ་དེ་ལོགས་སུ་ལུས་བཏུད་དེ་ཐལ་མོ་སྦྱར་ནས།
en: Not far from where the Bodhisattva was sitting, she broke through the earth’s surface and revealed her upper body, adorned with all sorts of jewels.

source: བྱང་ཆུབ་སེམས་དཔའ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: She bowed toward the Bodhisattva, joined her palms, and said to him,

source: །དེ་དེ་བཞིན་ནོ། །སྐྱེས་བུ་ཆེན་པོ་དེ་དེ་བཞིན་ནོ།
en: “You are right. Great Being, you are right.

source: །ཁྱོད་ཀྱིས་ཇི་སྐད་གསུངས་པ་བཞིན་ཏེ།
en: It is just as you say.

source: འདི་ནི་བདག་ལ་མངོན་སུམ་མོ།
en: We bear witness to this.

source: །དེ་ལྟ་ལགས་མོད་ཀྱི། འོན་གྱིས་ཀྱང་བཅོམ་ལྡན་འདས་ཉིད་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་དབང་དུ་གྱུར་པ་དང་། ཚད་མར་གྱུར་པ་དམ་པ་ལགས་སོ།
en: But still, my Lord, you alone are the supreme witness in the worlds of gods and humans and the supreme authority.”

source: །སའི་ལྷ་མོ་ཆེན་མོ་བརྟན་མས་དེ་སྐད་ཅེས་སྨྲས་ནས། རྣམ་པ་དུ་མར་བདུད་སྡིག་ཅན་གྱི་གླགས་ནི་མེད་པར་བྱས། བྱང་ཆུབ་སེམས་དཔའ་ལ་ནི་བསྟོད་དེ།
en: Having spoken thus, the earth goddess Sthāvarā rebuked Māra, the evil one, in many ways, and praised the Bodhisattva again and again.

source: རང་གི་མཐུ་རྣམ་པ་མང་པོ་བསྟན་ནས་འཁོར་དང་བཅས་ཏེ་དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཏོ།
en: She made a great display of her myriad powers and then disappeared together with her following there and then.

source: །གཡོན་ཅན་དཔུང་བཅས་ས་སྒྲ་དེ་ཐོས་ནས།
en: When the wicked one and his army heard that sound from the earth,

source: །ནགས་སུ་སེང་གེས་སྒྲ་བསྒྲགས་ཝས་ཐོས་དང་། །བྱ་རོག་རྡོ་འཕངས་མོད་ལ་འབྱེར་བ་བཞིན། །སྔངས་སྐྲག་སྙིང་གས་ཐམས་ཅད་རབ་ཏུ་བྱེར།
en: Frightened and disheartened, they all fled, Just like jackals in the forest hearing the lion’s roar, Or crows taking flight when a rock is thrown.

source: །དེ་ནས་བདུད་སྡིག་ཅན་སྡུག་བསྔལ་ཞིང་ཡིད་མི་བདེ་སྟེ།
en: Now Māra, the evil one, felt unhappy and full of suffering.

source: ཡི་མ་རངས་ལ་སྐྱེངས་བཞིན་དུ་ང་རྒྱལ་གྱི་ཟིལ་གྱིས་ནོན་པས་མ་སོང་ལ་ཕྱིར་ཡང་མ་ལོག་ཅིང་བྲོས་ཀྱང་མ་བྲོས་ཏེ་ཕྱིར་བལྟས་ནས་ཡང་དཔུང་རྣམས་ལ་སྨྲས་པ།
en: Still, even though he was miserable and ashamed of himself, he was overpowered by pride to such an extent that he could not leave; he could not turn back and flee. Therefore, he turned to his men and spoke:

source: ཁྱེད་ལྷན་ཅིག་འདུས་ཏེ་ཅུང་ཟད་ཅིག་སྡོད་ཅིག །རྣམ་པ་འདི་ལྟ་བུའི་སེམས་ཅན་རིན་པོ་ཆེ་གློ་བུར་དུ་ཆུད་མི་གཟན་པར་ཁོ་བོས་རྗེས་སུ་འཆགས་པས་འདི་བསླང་བར་ནུས་སམ་མི་ནུས་སད་པར་བྱའོ།
en: “All of you! Wait a while until we find out whether it is possible to arouse the Bodhisattva by polite persuasion. Such a jewel of a being should not be killed outright.”

source: །དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་རང་གི་བུ་མོ་རྣམས་ལ་སྨྲས་པ།
en: Then Māra, the evil one, spoke to his daughters:

source: བུ་མོ་ཁྱེད་དེང་སྟེ་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་སོང་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདོད་ཆགས་དང་བཅས་པའམ།
en: “Girls, you must go now to the seat of awakening and examine the Bodhisattva.

source: འོན་ཏེ་འདོད་ཆགས་མེད།
en: Does he have desires or not?

source: ཅི་གཏི་མུག་ཅན་ནམ། འོན་ཏེ་ཤེས་རབ་ཅན། ཅི་ལྡོངས་པ་ཞིག་གམ།
en: Is he deluded or intelligent?

source: འོན་ཏེ་ཕྱོགས་ཤེས་པ་ཞིག་གམ།
en: Is he like a blind man, or does he know the country and seek advantage?

source: འོན་ཏེ་དཔུང་གཉེན་མེད་པ་ཞིག་གམ།
en: And is he weak or strong?”

source: དམན་པ་ཞིག་གམ་བརྟན་པ་ཞིག་ཡིན་པ་བགོམས་ཤིག །ཚིག་དེ་ཐོས་ནས་བདུད་ཀྱི་བུ་མོ་དེ་དག་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ག་ལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: When they heard these words, these divine maidens went to the seat of awakening where the Bodhisattva was.

source: བྱང་ཆུབ་སེམས་དཔའི་མདུན་དུ་འཁོད་དེ། བུད་མེད་ཀྱི་སྒྱུ་རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་ཉེ་བར་བསྟན་ཏོ།
en: They assembled in front of the Bodhisattva and began displaying the thirty-two ways of female trickery.

source: །རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་གང་ཞེ་ན།
en: What are these thirty-two ways?
